import pandas as pd
from datetime import datetime

# 模擬資料
data = [

    ["2024/01", 2.43, 3.31],
    ["2024/02", 3.08, 3.39],
    ["2024/03", 2.14, 3.38],
    ["2024/04", 1.95, 3.36],
    ["2024/05", 2.24, 3.34],
    ["2024/06", 2.42, 3.37],
    ["2024/07", 2.52, 3.36],
    ["2024/08", 2.36, 3.38],
    ["2024/09", 1.82, 3.36],
    ["2024/10", 1.69, 3.37],
    ["2024/11", 2.08, 3.35],
    ["2024/12", 2.10, 3.32],

    ["2025/01", 2.12, 3.34],
    ["2025/02", 1.79, 3.36],
    ["2025/03", 2.18, 3.35],
    ["2025/04", 2.05, 3.37],
    ["2025/05", 1.88, 3.36],
    ["2025/06", 1.77, 3.35],
    ["2025/07", 1.92, 3.34],
    ["2025/08", 1.83, 3.35],
    ["2025/09", 1.74, 3.34],
    ["2025/10", 1.58, 3.33],
    ["2025/11", 1.49, 3.32],
    ["2025/12", 1.31, 3.30],

    ["2026/01", 2.66, 3.36],
    ["2026/02", 1.75, 3.33],
    ["2026/03", 1.20, 3.35],

]

df = pd.DataFrame(data, columns=["年月", "CPI年增率", "失業率"])

df["更新時間"] = datetime.now().strftime("%Y-%m-%d %H:%M:%S")

# 建立 data 資料夾
import os
os.makedirs("data", exist_ok=True)

# 輸出 CSV
df.to_csv(
    "data/taiwan_cpi_unemployment.csv",
    index=False,
    encoding="utf-8-sig"
)

# 輸出 JSON
df.to_json(
    "data/taiwan_cpi_unemployment.json",
    orient="records",
    force_ascii=False,
    indent=2
)

print(df)
print("完成")
